Revit 2027 API
Application.WriteJournalComment Method
 Writes a comment to the Revit journal file.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void WriteJournalComment(
	string comment,
	bool timeStamp
)
Public Sub WriteJournalComment (
	comment As String,
	timeStamp As Boolean
)
public:
void WriteJournalComment(
	String^ comment,
	bool timeStamp
)
member WriteJournalComment :
        comment : string *
        timeStamp : bool -> unit
Parameters
comment String
 Text for journal comment.
timeStamp Boolean
 If a time stamp should be included in the journal comment.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace